import img1 from '../images/img1.webp'
import img2 from '../images/img2.webp'


const activities = [
    {
        id: 1,
        title: "عنوان النشاط 1",
        body: "وصف النشاط 1. يمكن أن يتضمن هذا تفاصيل حول النشاط وماذا سيتعلمه أو يفعله المشاركون، وأي معلومات أخرى ذات صلة.",
        img: img1,
    },
    {
        id: 2,
        title: "عنوان النشاط 2",
        body: "وصف النشاط 2. يمكن أن يتضمن هذا تفاصيل حول النشاط وماذا سيتعلمه أو يفعله المشاركون، وأي معلومات أخرى ذات صلة.",
        img: img2,
    },
    {
        id: 3,
        title: "عنوان النشاط 2",
        body: "وصف النشاط 2. يمكن أن يتضمن هذا تفاصيل حول النشاط وماذا سيتعلمه أو يفعله المشاركون، وأي معلومات أخرى ذات صلة.",
        img: img2,
    },
    {
        id: 4,
        title: "عنوان النشاط 1",
        body: "وصف النشاط 1. يمكن أن يتضمن هذا تفاصيل حول النشاط وماذا سيتعلمه أو يفعله المشاركون، وأي معلومات أخرى ذات صلة.",
        img: img1,
    },
    {
        id: 5,
        title: "عنوان النشاط 2",
        body: "وصف النشاط 2. يمكن أن يتضمن هذا تفاصيل حول النشاط وماذا سيتعلمه أو يفعله المشاركون، وأي معلومات أخرى ذات صلة.",
        img: img2,
    },
    {
        id: 6,
        title: "عنوان النشاط 2",
        body: "وصف النشاط 2. يمكن أن يتضمن هذا تفاصيل حول النشاط وماذا سيتعلمه أو يفعله المشاركون، وأي معلومات أخرى ذات صلة.",
        img: img2,
    },
    {
        id: 7,
        title: "عنوان النشاط 1",
        body: "وصف النشاط 1. يمكن أن يتضمن هذا تفاصيل حول النشاط وماذا سيتعلمه أو يفعله المشاركون، وأي معلومات أخرى ذات صلة.",
        img: img1,
    },
    {
        id: 8,
        title: "عنوان النشاط 2",
        body: "وصف النشاط 2. يمكن أن يتضمن هذا تفاصيل حول النشاط وماذا سيتعلمه أو يفعله المشاركون، وأي معلومات أخرى ذات صلة.",
        img: img2,
    },
    {
        id: 9,
        title: "عنوان النشاط 2",
        body: "وصف النشاط 2. يمكن أن يتضمن هذا تفاصيل حول النشاط وماذا سيتعلمه أو يفعله المشاركون، وأي معلومات أخرى ذات صلة.",
        img: img2,
    },
    // Add more activities here following the same format
  ];
  
  export default activities;
  