
const SEO = [
      {
        name: "home",
        title: "جمعية النصر إمي نكرزي",
        description: "جمعية محلية تهدف إلى تطوير منطقة إمي نكرزي والحفاظ على البيئة من خلال مشاريع تنموية ومستدامة.",
        keywords: ["جمعية النصر", "إمي نكرزي", "تنمية"," بيئة", "مشاريع مستدامة","NGO"]
      },
      {
        name: "about-us",
        title: "نبذة عنا | جمعية النصر إمي نكرزي ",
        description: "تعرف على جمعية النصر إمي نكرزي، أهدافنا، فريقنا، وقصتنا في العمل على تطوير منطقة إمي نكرزي والحفاظ على البيئة.",
        keywords: ["جمعية النصر", "إمي نكرزي","من نحن", "أهداف", "فريق","قصة"]
      },
      {
        name: "contact-us",
        title: "تواصل معنا | جمعية النصر إمي نكرزي ",
        description: "تواصل معنا في جمعية النصر إمي نكرزي للمشاركة في الأنشطة والمشاريع أو للاستفسار عن كيفية المساهمة في تحسين مجتمعنا.",
        keywords: ["جمعية النصر", "إمي نكرزي", "تواصل معنا", "مشاركة", "استفسارات", "مساهمة"]
      },
      {
        name: "activities",
        title: "أنشطة الجمعية | جمعية النصر إمي نكرزي  ",
        description: "اكتشف أنشطة جمعية النصر إمي نكرزي في مجال التنمية والحفاظ على البيئة من خلال مشاريعنا المستدامة والمبتكرة.",
        keywords: ["جمعية النصر", "إمي نكرزي", "أنشطة", "تنمية", "بيئة", "مشاريع", "مستدامة"]
      }
    ]

export default SEO

  